
/*За лятната ваканция в спикъка със задължителна литература на Жоро има определен брой книги, но Жоро
предпочита да играе с приятели навън.Вашата задача е да помогнете на Жоро да изчисли колко часа на ден
трябва да отделя, за да прочете необходимата литература, но и да прекарва максимално време навън.
Вход
От конзолата се четат 3 реда:
1. Брой страници в текущата книга – цяло число в интервала[1…1000];
2. Страници, които може да прочита за 1 час – цяло число в интервала[1…1000];
3. Броя на дните, за които трябва да прочете книгата – цяло число в интервала[1…1000];
Изход
Да се отпечата на конзолата броят часове, които Жоро трябва да отделя за четене всеки ден.*/


#include <iostream>
using namespace std;

int main()
{
	int page1, page2, days;
	cin >> page1 >> page2 >> days;

	int time = page1 / page2;
	int total = time / days;

	cout << total << endl;
	return 0;
}
