
/*Напишете програма, която изчислява каква сума ще получите в края на депозитния период при определен
лихвен процент.Използвайте следната формула :
сума = депозирана сума + срок на депозита * ((депозирана сума * годишен лихвен процент) / 12)
Вход
От конзолата се четат 3 реда :
	1. Депозирана сума – реално число в интервала[100.00 … 10000.00];
2. Срок на депозита(в месеци) – цяло число в интервала[1…12];
3. Годишен лихвен процент – реално число в интервала[0.00 …100.00];*/


#include <iostream>
using namespace std;

int main()
{
	double depo;
	int srok;
	double lihva;
	cin >> depo >> srok >> lihva;

	double total = depo + srok * ((depo * lihva/100) / 12);

	cout << total << endl;
	return 0;
}
