

/*Преди време Пешо си е купил биткойни.Сега ще ходи на екскурзия из
Европа и ще му трябва евро.Освен биткойни има и китайски юани.
Пешо иска да обмени парите си в евро за екскурзията.Напишете
програма, която да пресмята колко евро може да купи спрямо следните валутни курсове :

1 биткойн = 1168 лева.
1 китайски юан = 0.15 долара.
1 долар = 1.76 лева.
1 евро = 1.95 лева.
Обменното бюро има комисионна от 0 до 5 процента от крайната сума в евро.

Входни данни
От конзолата се четат 3 числа:

На първия ред – броят биткойни.Цяло число в интервала[0 … 20].
На втория ред – броят китайски юани.Реално число в интервала[0.00 … 50 000.00].
На третия ред – комисионната.Реално число в интервала[0.00 … 5.00].
Изходни данни
На конзолата да се отпечата 1 число - резултатът от обмяната на валутите.Не е нужно резултатът да се закръгля.*/


#include <iostream>
using namespace std;

int main()
{
	int a1;
	double a2;
	double a3;
	cin >> a1 >> a2 >> a3;

	double b1 = a1 * 1168;
	double b2 = a2 * 0.15;
	double b3 = b2 * 1.76;
	double b4 = b1 + b3;
	double b5 = b4 / 1.95;
	double b6 = 0.05 * b5;
	double b7 = b5 - b6;

	cout << b7 << endl;
	return 0;
}


