

/*Правоъгълник е зададен с координатите на два от своите срещуположни
ъгъла(x1, y1) –(x2, y2).Да се пресметнат площта и периметъра му.
Входът се чете от конзолата.Числата x1, y1, x2 и y2 са дадени по 
едно на ред.Изходът се извежда на конзолата и трябва да съдържа два
реда с по една число на всеки от тях – лицето и периметъра.*/


#include <iostream>
using namespace std;

int main()
{

	int x1, y1, x2, y2;
	cin >> x1 >> y1 >> x2 >> y2;
	int a1 = abs(x1 - x2);
	int a2 = abs(y1 - y2);

	int lice = a1 * a2;
	int perimeter = 2 * (a1 + a2);

	cout << lice << endl;
	cout << perimeter << endl;
	return 0;
}
