


/*Да се напише програма, която чете час и минути от 24 - часово денонощие, въведени от потребителя и
изчислява колко ще е часът след 15 минути.Резултатът да се отпечата във формат часове : минути.Часовете
винаги са между 0 и 23, а минутите винаги са между 0 и 59. Часовете се изписват с една или две цифри.
Минутите се изписват винаги с по две цифри, с водеща нула, когато е необходимо.*/


#include <iostream>
using namespace std;

int main()
{

	int a1, a2;
	cin >> a1 >> a2;

	int b1 = a1 * 60 + a2;
	int b2 = b1 + 15;
	int b3 = b2 / 60;
	int b4 = b2 % 60;

	if (b3 >= 24)
	{
		b3 -= 24;
	}

	if (b4 < 10)
	{
		cout << b3 << ":0" << b4 << endl;
	}
	else
	{
		cout << b3 << ":" << b4 << endl;
	}
	return 0;
}

